/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ld.c                                               :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: draudrau <draudrau@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/10/04 21:37:54 by draudrau          #+#    #+#             */
/*   Updated: 2019/10/04 22:07:27 by draudrau         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "../corewar.h"

int     ft_valid_arg_ld(int pc)
{
    
}
void    ft_ld(t_cw *cw, t_crg *crg)
{
    int arg_1;
    int arg_2;

    //if (ft_valid_arg_ld(crg->pc + 1) == 0)
    //
    //
    if (arg_1 == 2) // первый аргумент T_DIR
    {
        
    }

}